Bachelor Thesis/3D.00/q10.131/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   nonuniform List<vector> 
119952
(
(1.1295 0 0)
(1.1295 0 0)
(1.1295 0 0)
(1.1295 0 0)
(1.1295 0 0)
(1.1295 0 0)
(1.1295 0 0)
(1.1295 0 0)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        valueOld        uniform ( 1.1 0 0 );
        value           nonuniform List<vector> 
79
(
(1.1295 0 0)
(1.1295 0 0)
(1.1295 0 0)
(1.1295 0 0)
(1.1295 0 0)
(1.1295 0 0)
(1.1295 0 0)
(1.1295 0 0)
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform ( 0 0 0 );
    }
    left
    {
        type            slip;
    }
    right
    {
        type            slip;
    }
    riverSlope_riverSlope
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
}
