Bachelor Thesis/3D.00/q10.131/0/alpha1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 0 0 0 0 ];

internalField   nonuniform List<scalar> 
119952
(
1
1
1
1
1
1
1
1
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        valueOld        uniform 0;
        value           nonuniform List<scalar> 
79
(
1
1
1
1
1
1
1
1
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    atmosphere
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    left
    {
        type            slip;
    }
    right
    {
        type            slip;
    }
    riverSlope_riverSlope
    {
        type            fixedValue;
        value           uniform 1;
    }
}
