Bachelor Thesis/3D.00/q10.131/system/surfaceFeatureExtractDict.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
riverSlope.stl
{
	extractionMethod    extractFromSurface;

	extractFromSurfaceCoeffs
	{
		includedAngle   179;
	}
 	subsetFeatures
    	{
        	// Keep nonManifold edges (edges with >2 connected faces)
        	nonManifoldEdges       yes;

        	// Keep open edges (edges with 1 connected face)
        	openEdges       yes;
    	}



	writeObj                yes;
}
// ************************************************************************* //
